Autodesk.Revit.UI.LicensingUtils.CheckExtensionLicense(System.Guid)
Checks if the user has a valid extension license for given product.
Remarks:
This call is silent, only check the Entitlement of the currently logged in account.
A valid license must be released by calling Autodesk.Revit.UI.LicensingUtils.ReleaseLicense(System.Guid) before Revit shuts down.
productId:
Product id.
Returns:
Entitlement status
Since:
2021

Autodesk.Revit.UI.LicensingUtils.ReleaseLicense(System.Guid)
Releases a license for a given product obtained by Autodesk.Revit.UI.LicensingUtils.CheckLicense(System.Guid).
productId:
Product id.
Since:
2021

Autodesk.Revit.UI.LicensingUtils.CheckLicense(System.Guid)
Checks if the user has a valid license for given product.
Remarks:
This call will launch a sign in dialog and require the user to sign in order to complete the check if the user is not currently signed in.
A valid license must be released by calling Autodesk.Revit.UI.LicensingUtils.ReleaseLicense(System.Guid) when Revit shuts down.
productId:
Product id.
Returns:
True if the license for the given product is valid.
Since:
2021

Autodesk.Revit.UI.LicensingUtils.GetProductId(System.String,System.String,System.String)
Registers a product with the licensing component and returns an id of the product to be used when checking for a valid license.
productName:
Product name.
productKey:
Product id.
featureId:
Feature id.
Returns:
Id of the product.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2021

Autodesk.Revit.UI.LicensingUtils
A collection of functions related to a product license checking.
Since:
2021